{
    "content": {
        "contact": {
            "name": "Prithviraj Chaudhuri",
            "email": "p.chaudhuri1993@gmail.com",
            "linked_in": "https://www.linkedin.com/in/prithviraj-chaudhuri-455413b2/",
            "location": "Raleigh, North Carolina",
            "picture": "resources/assets/img/profile.jpeg"
        },
        "about": {
            "mission": "I am a Senior Software Applications Engineer with a Master's in Computer Science. My journey includes impactful roles at Red Hat, Inc., North Carolina State University, and Tata Consultancy Services. Proficient in Full Stack and Systems-level Programming, I have excelled in implementing new features, conducting defect investigations, and deploying applications using varied technologies. Eager to contribute to cutting-edge projects, I am committed to elevating software engineering excellence in Software Engineering roles.",
            "educational_qualification": [
                {
                    "id": "course_ncsu",
                    "qualification": "Masters in Computer Science",
                    "institute": "North Carolina State University",
                    "time": "August 2019 - May 2021",
                    "score": "GPA 3.92",
                    "courses": "Artificial Intelligence, Parallel Architectures, Parallel Systems, Automated Learning and Data Analysis, Compiler Construction, Independent Study on Educational Systems, Advanced Machine Learning, Real Time/Embedded Systems and Machine Learning for Autonomous driving",
                    "projects": [
                        "Achieved successful customizations and research projects on the open-source online courseware hosting platform OpenEdx. Measured impact through enhanced functionality and user satisfaction, implementing services across multiple servers, and establishing a Django-powered dashboard for efficient configuration management.",
                        "Accomplished the development of a Slack bot for classroom management, adhering to robust software engineering practices. Utilized DevOps tools such as Git, Travis CI, Docker, docker-compose, Makefiles, etc. Quantified success through streamlined communication and improved classroom efficiency.",
                        "Executed an in-depth analysis of transformer networks, CNNs, and word embeddings on the flickr9k dataset. Evaluated performance based on Bleu Score and Cosine similarity for caption prediction of images, contributing valuable insights to the field of image captioning.",
                        "Successfully conducted a comprehensive study on Multimodal Classification performance using Python TensorFlow, comparing it against Single mode classification on the Yelp dataset. Demonstrated the effectiveness of multimodal approaches over standard classification methods, emphasizing improved accuracy and classification results.",
                        "Demonstrated the efficiency gains of parallel processing using CUDA, OpenACC, OpenMP, and MPI in comparison to standard single-thread processing. Achieved optimization in algorithmic performance, with measured improvements in execution time and resource utilization."
                    ]
                },
                {
                    "id": "course_rcc",
                    "qualification": "Bachelor of Technology, Computer Science",
                    "institute": "RCC Institute of Information Technology",
                    "time": "August 2012 – June 2016",
                    "score": "GPA 8.71/10",
                    "courses": "Data Structures, DBMS, Object Oriented Programming, Operating Systems, Compiler Design, Microprocessors, Image Processing",
                    "projects": [
                        "Executed the development and management of a suite of four web applications for the annual sports, technical, and cultural festivals of the College. Measured success by enhanced user engagement and seamless festival coordination.",
                        "Established a new feature selection algorithm to boost supervised learning speeds on specific datasets. Quantified achievement through measured improvements in algorithmic efficiency and overall learning performance."
                    ]
                }
            ],
            "resume": "./resources/assets/downloads/Prithviraj%20Chaudhuri%20Resume.pdf"
        },
        "experience": [
            {
                "title": "Red Hat, Inc.",
                "time": "June 2021 - Present",
                "role": "Senior Software Applications Engineer",
                "projects": [
                    "Implement new features on applications as per requirement, ensuring the implementations follow best software engineering practices and are optimal. Requirements can be both for frontend and backend parts of the application.",
                    "Investigate and fix any defect or bug that gets highlighted, often in collaboration with other teams.",
                    "Write and execute any adhoc bash or python scripts as and when required.",
                    "Configure OpenShift containers and pipelines as required for new or existing applications.",
                    "Write infrastructure configuration files in Ansible to build and deploy apps on OpenStack hosts as and when required.",
                    "After being promoted to Senior Software Applications Engineer my responsibilities also involve peer reviewing work and involving myself with decisions regarding system architectures.",
                    "Took over and implemented customizations on custom marketing and sales platform in Adobe Experience Manager",
                    "Worked on the migration of applications and hosts from legacy datacenters to OpenStack virtual machines and implemented loadbalancers and host groups using OpenStack CLI",
                    "Implemented infrastructure on AWS EKS for lucidworks fusion as part of the migration process from on prem to cloud native installations",
                    "Used Java Spring Boot and angular to implement bulk upload of user data to resource management application.",
                    "Migration of existing application from older OpenShift cluster to newer ones involving creation of updated CI/CD pipelines.",
                    "Setting up Ansible playbooks to provision virtual hosts on OpenStack and automatically setup hosts to migrate applications off existing Hosts.",
                    "Fixing thread issues and other inconsistencies with group management suite of applications.",
                    "Built APIs for other applications to utilize services from applications hosted by the team.",
                    "Developed UI front end and made backend modifications to add administrator functionalities on an existing application.",
                    "Built integrations on Google Chat bot to interact with other internal application APIs for easier data availability by chat commands.",
                    "Developed Gitlab CI/CD pipelines to automate functional testing running on an OpenStack host.",
                    "Configured and modified AWS EKS cluster infrastructure for hosting vendor provided crawling and data pipelining application."
                ]
            },
            {
                "title": "North Carolina State University",
                "time": "January 2020 - May 2021",
                "role": "Graduate Research Assistant at <a href='https://www.ieclab.org/'>IEC Lab</a>",
                "projects": [
                    "Implement customizations in OpenEdx as required.",
                    "Modify research project implementations to make them easy to maintain and easily deployable using Docker and docker-compose.",
                    "Occasionally refer to research papers used by the lab to implement projects to understand the correct working condition and make sure that they remain the same after modifications for hosting them on the servers.",
                    "Integrate research projects with OpenEdx to create smart coursework modules.",
                    "Configure servers and applications being hosted on them and automate functionalities for easier maintenance.",
                    "Established automated course restructuring using existing student performance.",
                    "Integrated research projects to enable more intelligent and dynamic course generation in OpenEdx.",
                    "Customized OpenEdx environments for automated deployment and migration of courses between environments.",
                    "Developed Django administration panel to enable easy setup and configuration of applications across multiple servers.",
                    "Automated deployment of applications across servers using Docker and docker-compose.",
                    "Implemented custom learning components on OpenEdx for better course construction and easy migration of courses",
                    "Created OpenEdx customizations to enable smarter import and export of course content between OpenEdx environments"
                ]
            },
            {
                "title": "Red Hat, Inc.",
                "time": "May 2020 - August 2020",
                "role": "Full Stack Web Developer Intern",
                "projects": [
                    "Implement new features on applications as per requirement, ensuring the implementations follow best software engineering practices and are optimal. Requirements can be both for front end and backend parts of the application.",
                    "Investigate and fix any defect or bug that gets highlighted, often in collaboration with other teams.",
                    "Configure OpenShift containers and pipelines as required for new or existing applications.",
                    "Used Java Spring Boot and Pug/Jade to implement bulk upload of data to resource management application.",
                    "Enhanced search application to enable smart searching of employee records in the organization.",
                    "Containerized applications to establish automated deployment using OpenShift and Jenkins.",
                    "Designed and developed automated deployment driven by Jenkins and Git for faster delivery times and easy maintenance.",
                    "Studied feasibility of deploying applications on multiple cloud platforms of OpenShift."
                ]
            },
            {
                "title": "Tata Consultancy Services",
                "time": "July 2016 - August 2019",
                "role": "Systems Engineer",
                "projects": [
                    "Understand client requirements and implement the best possible solutions accordingly",
                    "Investigate, identify, and fix any defects in the platform",
                    "Implement automations within the platform wherever possible",
                    "Work on both Front-end UI and the backend logic",
                    "Implement integrations between the platform and other applications mostly via REST or alternate mechanisms if needed",
                    "Implemented Service Catalog on ServiceNow for end users to utilize ServiceNow ITSM modules using CMS",
                    "Integrated ServiceNow with external systems to streamline information flow",
                    "Automated tasks by translating manual processes to system and leveraging ServiceNow orchestration platform",
                    "Designed and developed a unified REST API integration application on ServiceNow to enable faster integration with other applications",
                    "Migrated Service Catalog hosted in CMS to Service Portal using Angular JS",
                    "Established asynchronous data exchange between ServiceNow and Microsoft Active Directory",                  
                    "Implemented Service Catalog on ServiceNow for end users to utilize ServiceNow ITSM modules using CMS",
                    "Integrated ServiceNow with external systems to streamline information flow",
                    "Automated tasks by translating manual processes to system and leveraging ServiceNow orchestration platform",
                    "Designed and developed a unified REST API integration application on ServiceNow to enable faster integration",
                    "Migrated Service Catalog hosted in CMS to Service Portal using Angular JS"
                ]
            },
            {
                "title": "ObjectSol Technologies Pvt Ltd.",
                "time": "July 2016 - August 2016",
                "role": "Intern",
                "projects": [
                    "Retrieved large counts of tweets from Twitter and stored in a single node Cassandra database",
                    "Classified Tweets in positive or negative sentiments with OpenNLP Java APIs",
                    "Leveraged StanfordNLP to find keywords in tweets to improve insights"
                ]
            },
            {
                "title": "Glamoz.com.",
                "time": "August 2015 - December 2015",
                "role": "Intern",
                "projects": [
                    "Created search algorithms for faster and contextual searches of various user profiles while interacting with backend databases",
                    "Utilized various jQuery plugins to enable users to edit pictures, upload videos etc",
                    "Incorporated Facebook and Google login options"
                ]
            }
        ],
        "projects": [
            {
                "type": "Systems Projects",
                "list": [
                    "Improved performance of simulation algorithm by leveraging parallel device and multithreaded capabilities of CUDA, OpenACC, OpenMP and MPI. Optimized algorithm my carefully managing memory operations",
                    "Studied performance benefits of the same algorithm by leveraging parallel processing using CUDA, OpenACC, OpenMP and MPI",
                    "Used OpenMP to implement parallel sorting algorithms for evaluating performance benefits vs overheads"
                ]
            },
            {
                "type": "Data Science Projects",
                "list": [
                    "Studied performance of various transformer networks,CNNsand word embeddingsin terms of Bleu Score and Cosine similarityon flickr9k dataset. Used python and tensorflow 2.1",
                    "Performed a study on Multimodal Classification performance (using Python TensorFlow) vs Single mode classification on Yelp dataset to prove whether multimodal performance is better than standard classification",
                    "Accomplished a Feature Selection algorithm leveraging mutual information and Laplacian scores to select relevant features (R, Matlab)",
                    "Sentiment Analysis of Tweets (Java, Cassandra, Natural Language Processing)<ul><li>Retrieved large counts of tweets from Twitter and stored in a single node Cassandra database</li><li>Classified Tweets in positive or negative sentiments with OpenNLP Java APIs</li><li>Leveraged StanfordNLP to find keywords in tweets to improve insights</li></ul>"
                ]
            },
            {
                "type": "Web Developement Projects",
                "list": [
                    "Created interactive and responsive websites for out annual festivals, enabling increases attention from other Undergraduate colleges",
                    "Designed and Developed registration portal for festival participants to enroll for events, restulting in streamlining and reduced delay in the process"
                ]
            }
        ],
        "skills": [
            {
                "type": "Profecient",
                "list": [
                    {
                        "skill": "HTML"
                    },
                    {
                        "skill": "CSS"
                    },
                    {
                        "skill": "JavaScript"
                    },
                    {
                        "skill": "jQuery"
                    },
                    {
                        "skill": "Angular"
                    },
                    {
                        "skill": "React"
                    },
                    {
                        "skill": "Python"
                    },
                    {
                        "skill": "Java"
                    },
                    {
                        "skill": "Java Spring Boot"
                    },
                    {
                        "skill": "PostgreSQL"
                    },
                    {
                        "skill": "MySQL"
                    },
                    {
                        "skill": "Makefiles"
                    },
                    {
                        "skill": "Git"
                    },
                    {
                        "skill": "Gitlab Pipelines"
                    },
                    {
                        "skill": "ServiceNow"
                    },
                    {
                        "skill": "OpenEdx"
                    },
                    {
                        "skill": "OpenShift"
                    },
                    {
                        "level": "Proficient",
                        "skill": "Docker"
                    },
                    {
                        "skill": "Kubernetes"
                    },
                    {
                        "skill": "OpenStack"
                    },
                    {
                        "skill": "Adobe Experience Manager"
                    },
                    {
                        "skill": "AWS"
                    }
                ]
            },
            {
                "type": "Intermediate",
                "list": [
                    {
                        "skill": "PHP"
                    },
                    {
                        "skill": "C#"
                    },
                    {
                        "skill": "ASP.NET"
                    },
                    {
                        "skill": "OpenMP"
                    },
                    {
                        "skill": "MPI"
                    },
                    {
                        "skill": "CUDA"
                    },
                    {
                        "skill": "OpenMP"
                    },
                    {
                        "skill": "MPI"
                    },
                    {
                        "skill": "R"
                    },
                    {
                        "skill": "Matlab"
                    },
                    {
                        "skill": "Java Spring Boot"
                    },
                    {
                        "skill": "Mockito Testing"
                    },
                    {
                        "skill": "Alfresco Document Management"
                    }
                ]
            }
        ],
        "extra": []
    }
}