{
    "content": {
        "github_username": "prithviraj-chaudhuri",
        "contact": {
            "name": "Prithviraj Chaudhuri",
            "title": "Senior Software Engineer",
            "bio":"Passionate about building scalable web applications and solving complex problems. Experienced in full-stack development with expertise in React, TypeScript, and Node.js",
            "location": "Toronto, Ontario",
            "email": "p.chaudhuri1993@gmail.com",
            "linkedin": "https://www.linkedin.com/in/prithviraj-chaudhuri-455413b2/",
            "avatar": "/images/profile.jpeg",
            "resume": "/downloads/Prithviraj%20Chaudhuri%20Resume.pdf"
        },
        "educational_qualification": [
            {
                "id": "course_ncsu",
                "title": "Masters in Computer Science",
                "institution": "North Carolina State University",
                "period": "August 2019 - May 2021",
                "grade": "GPA 3.92",
                "courses": [
                    "Artificial Intelligence",
                    "Parallel Architectures",
                    "Parallel Systems",
                    "Automated Learning and Data Analysis",
                    "Compiler Construction",
                    "Independent Study on Educational Systems",
                    "Advanced Machine Learning",
                    "Real Time/Embedded Systems",
                    "Machine Learning for Autonomous Driving"
                ],
                "projects": [
                    "Achieved successful customizations and research projects on the open-source online courseware hosting platform OpenEdx. Measured impact through enhanced functionality and user satisfaction, implementing services across multiple servers, and establishing a Django-powered dashboard for efficient configuration management.",
                    "Accomplished the development of a Slack bot for classroom management, adhering to robust software engineering practices. Utilized DevOps tools such as Git, Travis CI, Docker, docker-compose, Makefiles, etc. Quantified success through streamlined communication and improved classroom efficiency.",
                    "Executed an in-depth analysis of transformer networks, CNNs, and word embeddings on the flickr9k dataset. Evaluated performance based on Bleu Score and Cosine similarity for caption prediction of images, contributing valuable insights to the field of image captioning.",
                    "Successfully conducted a comprehensive study on Multimodal Classification performance using Python TensorFlow, comparing it against Single mode classification on the Yelp dataset. Demonstrated the effectiveness of multimodal approaches over standard classification methods, emphasizing improved accuracy and classification results.",
                    "Demonstrated the efficiency gains of parallel processing using CUDA, OpenACC, OpenMP, and MPI in comparison to standard single-thread processing. Achieved optimization in algorithmic performance, with measured improvements in execution time and resource utilization."
                ]
            },
            {
                "id": "course_rcc",
                "title": "Bachelor of Technology, Computer Science",
                "institution": "RCC Institute of Information Technology",
                "period": "August 2012 – June 2016",
                "grade": "GPA 8.71/10",
                "courses": [
                    "Data Structures",
                    "DBMS",
                    "Object Oriented Programming",
                    "Operating Systems",
                    "Compiler Design",
                    "Microprocessors",
                    "Image Processing"
                    ],
                "projects": [
                    "Executed the development and management of a suite of four web applications for the annual sports, technical, and cultural festivals of the College. Measured success by enhanced user engagement and seamless festival coordination.",
                    "Established a new feature selection algorithm to boost supervised learning speeds on specific datasets. Quantified achievement through measured improvements in algorithmic efficiency and overall learning performance."
                ]
            }
        ],
        "experience": [
            {
                "id": "rh_full",
                "title": "Red Hat",
                "time": "June 2021 - Present",
                "role": "Senior Software Applications Engineer",
                "description": "My team maintains and develops a suite of applications used internally within the organization mainly catered towards managing content and logic around content. We build new features and solutions on top of those applications, ensure the solutions provided are optimal and follow best practices as well as resolve any bugs and defects in those applications.",
                "responsibilities": [
                    "Implement new features on applications as per requirement, ensuring the implementations follow best software engineering practices and are optimal. Requirements can be both for frontend and backend parts of the application.",
                    "Investigate and fix any defect or bug that gets highlighted, often in collaboration with other teams.",
                    "Write and execute any adhoc bash or python scripts as and when required.",
                    "Configure OpenShift containers and pipelines as required for new or existing applications.",
                    "Write infrastructure configuration files in Ansible to build and deploy apps on OpenStack hosts as and when required.",
                    "After being promoted to Senior Software Applications Engineer my responsibilities also involve peer reviewing work and involving myself with decisions regarding system architectures."
                ],
                "projects": [
                    {
                        "description": "Develop, deploy and maintain site(s) and assets hosted on marketing and sales platform Adobe Experience Manager (AEM).",
                        "tech_used": [
                            "Apache Sling",
                            "JCR",
                            "OSGI",
                            "React"
                        ],
                        "highlights": [
                            "Implemented custom container component for personalization of content in site pages",
                            "Developed impersonation functionality for authors to confirm page and content permissions",
                            "Generated custom events for Adobe Analytics for building analytics reports for admins and authors to monitor page click through and activity",
                            "Enhanced UI and implemented bug fixes as required for improved usability",
                            "Developed automated scripts to run deployments and trigger Adobe Cloud Manager pipelines for faster development",
                            "Created custom metadata fields and client side metadata field logic to control metadata inputs by authors, which enabled better consistancy in content",
                            "Developed detailed documentation and standardized processes for on boarding new devs on the project",
                            "Customized login and enhanced user on boarding logic for better user manangement and access control throughout the system. This enabled third party users to be on boarded into the system and creat consistant experience between external and internal users of the organization"
                        ]
                    },
                    {
                        "description": "Migrate on prem implementation of Lucidworks fusion to on AWS EKS and maintain new installation",
                        "tech_used": [
                            "AWS",
                            "EKS",
                            "Kubernetes",
                            "Helm"
                        ],
                        "highlights": [
                            "Led deployment Lucidworks fusion on AWS EKS to stay up-to-date with newest version",
                            "Coordinated with IT Cloud teams to ensure deployment followed proper compliance requirements and security protocols",
                            "Troubleshooted instance via AWS and Kubernetes CLI and developed recovery scripts for corrupted pods for faster resolution times",
                            "Performed POCs to enhance logging and monitoring to ensure relevant alerts and minimal cost impact",
                            "Performed regular upgrade and debug sessions with vendor for installation"
                        ]
                    },
                    {
                        "description": "Migration of puppet managed RHEL-6 hosts to Ansible managed RHEL-9 OpenStack virtual machines",
                        "tech_used": [
                            "Ansible",
                            "OpenStack",
                            "Gitlab",
                            "Linux",
                            "OpenStack CLI"
                        ],
                        "highlights": [
                            "Led the technical implementation of this project",
                            "Constructed Ansible playbooks for building and deploying virtual machines on OpenStack in place puppet managed RHEL-6 hosts, to ensure security compliance and modern operating platform",
                            "Ensured end user functionality remains the same as previous to minimize loss in productivity of non-technical users on the hosts",
                            "Implemented custom Ansible roles and coordinated with Identity management teams to ensure access control and security guidelines are compliant",
                            "Implemented loadbalancers and network configuration to use with VMs via the OpenStack CLI"
                        ]
                    },
                    {
                        "description": "Alfresco",
                        "tech_used": [
                            "Alfresco",
                            "Java",
                            "Javascript",
                            "Docker",
                            "docker-compose"
                        ],
                        "highlights": [
                            "Implemented UI enhancements for custom reporting dashlet to improve reporting",
                            "Added OpenShift custom liveness probes to monitor in pod memory usage and restart containers as required"
                        ]
                    },
                    {
                        "description": "Implementing Cypress Automated Testing frameworks in gitlab pipelines",
                        "tech_used": [
                            "Cypress",
                            "Gitlab Pipelines",
                            "OpenStack"
                        ],
                        "highlights": [
                            "Led the technical implementation of this project",
                            "Organizaed gitlab repository to build custom testing image for cypress to deploy to internal repositories",
                            "Implemented Ansible playbook to generate and install prerequisites to create Automated Testing host on OpenStack",
                            "Developed gitlab pipelines to trigger automated testing on OpenStack host to ensure automated testing requirements are fulfilled before deployment"
                        ]
                    },
                    {
                        "description": "Integrated Google Chat Bot with people display application",
                        "tech_used": [
                            "Quarkus",
                            "Java",
                            "REST APIs"
                        ],
                        "highlights": [
                            "Implemented custom REST end-point on people display application behind OAuth authorization to ensure proper securtity compliance",
                            "Developed google chat UI to consume above end-point and display people information from the organization"
                        ]
                    },
                    {
                        "description": "Customizations on in house Java applications for people and group management",
                        "tech_used": [
                            "Java Sprint Boot",
                            "Angular JS",
                            "PostgreSQL",
                            "Python",
                            "Gitlab",
                            "OpenShift",
                            "Docker"
                        ],
                        "highlights": [
                            "Used Java Spring Boot and angular to implement bulk upload of user data to resource management application",
                            "Troubleshoot and debug thread issues and other inconsistencies with group management suite of applications",
                            "Built APIs for other applications to utilize services from applications hosted by the team",
                            "Developed UI front end and made backend modifications to add administrator functionalities on an existing application",
                            "Migrated application deployments between different OpenStack clusters and customized Gitlab Pipelines as required"
                        ]
                    },
                    {
                        "description": "Other ad-hoc jobs, integrations and responsibilities",
                        "tech_used": [
                            "Python",
                            "Java"
                        ],
                        "highlights": [
                            "Troubleshoot and coordinate with other teams to troubleshoot and debug jobs integrating data to and from other applications to our data stores",
                            "Coordinating with Identity management to troubleshoot group creation and management requirements between LDAP, Google groups and our group manangement application",
                            "Built ad-hoc python jobs to exchange data between Apache Active MQ and our applications, generate custom notifications from internal content websites etc."
                        ]
                    }
                ]
            },
            {
                "id": "ncsu_part",
                "title": "North Carolina State University",
                "time": "January 2020 - May 2021",
                "role": "Graduate Research Assistant at IEC Lab",
                "description": "As a Graduate Research Assistant my primary role in the research group was as a programmer. I was tasked with implementing customizations in OpenEdx (an open-source courseware hosting platform) and research projects that worked along with OpenEdx and building tools to manage these applications.",
                "responsibilities": [
                    "Implement customizations in OpenEdx as required",
                    "Modify research project implementations to make them easy to maintain and easily deployable using Docker and docker-compose",
                    "Occasionally refer to research papers used by the lab to implement projects to understand the correct working condition and make sure that they remain the same after modifications for hosting them on the servers",
                    "Integrate research projects with OpenEdx to create smart coursework modules",
                    "Configure servers and applications being hosted on them and automate functionalities for easier maintenance"
                ],
                "projects": [
                    {
                        "description": "Creation of custom components in OpenEdx for custom quizes",
                        "tech_used": [
                            "Django",
                            "Python",
                            "Docker",
                            "docker-compose"
                        ],
                        "highlights": [
                            "Created OpenEdx customizations to enable smarter import and export of course content between OpenEdx environments",
                            "Implemented custom OpenEdx components for authoring and presenting custom quizes to students",
                            "Built and integrated hint generation service with custom components to display personalized hints to students, based on research algorithms",
                            "Integrated rule based authoring and tutoring UIs to be used as custom component with OpenEdx so that students can learn by teaching and then quiz themselves",
                            "Integrated custom component to suggest new questions and modules based on students progress as a realization of reasearch papers"
                        ]
                    },
                    {
                        "description": "Development of management dashboard to control project hyper-parameters and states",
                        "tech_used": [
                            "Django",
                            "Python",
                            "Docker",
                            "docker-compose",
                            "Linux"
                        ],
                        "highlights": [
                            "Optimized and refactored applications to enable them to be run on Docker Images for easier dev and production setup",
                            "Configured Linux servers to host multiple applications and created detailed documentation for easier recovery and maintenance",
                            "Created Django dashboard for monitoring states of all services and current parameters as well as restarting them as nessecary"
                        ]
                    }
                ]
            },
            {
                "id": "rh_part",
                "title": "Red Hat, Inc.",
                "time": "May 2020 - August 2020",
                "role": "Full Stack Web Developer Intern",
                "description": "I worked as a Full Stack Web Developer Intern for the IT Document Management & Collaboration team at Red Hat. The team maintains and develops a suite of applications used internally within the organization. As part of the team, we build new features and solutions on top of those applications, ensure the solutions provided are optimal and follow best practices as well as resolve any bugs and defects in those applications. My responsibilities within the team were as below.",
                "responsibilities": [
                    "Implement new features on applications as per requirement, ensuring the implementations follow best software engineering practices and are optimal. Requirements can be both for front end and backend parts of the application.",
                    "Investigate and fix any defect or bug that gets highlighted, often in collaboration with other teams",
                    "Configure OpenShift containers and pipelines as required for new or existing applications"
                ],
                "projects": [
                    {
                        "description": "Containerizing data analytics application and deploying to OpenShift",
                        "tech_used": [
                            "OpenShift",
                            "Gitlab Pipeline",
                            "Docker",
                            "Jenkins"
                        ],
                        "highlights": [
                            "Containerized applications to establish automated deployment using OpenShift and Jenkins to enable faster deployment and upgrade capabilities"
                        ]
                    },
                    {
                        "description": "Customizations on in house Java applications for people and group management",
                        "tech_used": [
                            "Java Sprint Boot",
                            "Angular JS",
                            "PostgreSQL",
                            "Python",
                            "Gitlab",
                            "OpenShift",
                            "Docker"
                        ],
                        "highlights": [
                            "Used Java Spring Boot and Pug/Jade to implement bulk upload of data to resource management application for better usability and group administration",
                            "Enhanced search application to enable smart searching of employee records in the organization",
                            "Designed and developed automated deployment driven by Jenkins and Git for faster delivery times and easy maintenance"
                        ]
                    }
                ]
            },
            {
                "id": "tcs_full",
                "title": "Tata Consultancy Services",
                "time": "July 2016 - August 2019",
                "role": "Systems Engineer",
                "description": "I joined TATA Consultancy Services Limited (TCS) as an Assistant systems engineer - Trainee. I ended my employment in the company with the designation Systems Engineer. At Tata Consultancy Services Ltd (TCS), I worked in the role of a ServiceNow Developer. The team maintained and built new features and automations on a ServiceNow environment for a client. The team would develop and deliver solutions to the requirements as given by the client, also act as technical advisors to suggest innovative methods to solve business needs.",
                "responsibilities": [
                    "Understand client requirements and implement the best possible solutions accordingly",
                    "Investigate, identify, and fix any defects in the platform",
                    "Implement automations within the platform wherever possible",
                    "Work on both Front-end UI and the backend logic",
                    "Implement integrations between the platform and other applications mostly via REST or alternate mechanisms if needed"
                ],
                "projects": [
                    {
                        "description": "Implemented REST API Integrator with inbuilt asynchrounous and synchronous api hosting capabilities for low code REST API integration",
                        "tech_used": [
                            "ServiceNow",
                            "Javascript",
                            "REST"
                        ],
                        "highlights": [
                            "Built a REST API integrator platform for simple integration with third party applications via REST",
                            "Added capabilities to trigger webhooks and monitor statuses for asynchronous jobs",
                            "Built feature to host asynchronous Web hooks as well to run jobs on the platform asynchronously",
                            "Implemented features to map json object properties to table and implement transformations for inbound and outbound data",
                            "Developed structured logging capabilities to audit and debug integration logs"
                        ]
                    },
                    {
                        "description": "Added Custom functionality to execute powershell command on Mid Server for SCOM",
                        "tech_used": [
                            "Powershell",
                            "ServiceNow",
                            "Mid Server"
                        ],
                        "highlights": [
                            "Modified and designed solution for running jobs on Mid server on events occuring in ServiceNow",
                            "Created table to keep track of messages processed asynchronously and call job on Mid Server"
                        ]
                    },
                    {
                        "description": "Implemented scheduled Exports and Imports between ServiceNow and other application",
                        "tech_used": [
                            "ServiceNow",
                            "Mid Server"
                        ],
                        "highlights": [
                            "Created custom scheduled imports from mid server via CSV files exported from other applications for user on boarding",
                            "Developed transform maps to clean up import of user data from csv",
                            "Implemented custom data exports for consumption of multiple applications from ServiceNow"
                        ]
                    },
                    {
                        "description": "Automations with ServiceNow Orchestration",
                        "tech_used": [
                            "ServiceNow",
                            "Mid Server",
                            "Orchestration"
                        ],
                        "highlights": [
                            "Used orchestration framework to create custom workflow activities to run remote powershell commands on Mail Exchange and Active Directory commands",
                            "Created Automation workflows for user onboarding within organization by integrating with Mail and Active Directory",
                            "Designed and developed automation for creating and onboarding users to application providing secured folder spaces",
                            "Automated server provisioning and decommision using orchestration activities for faster turn resolution time for standard operations"
                        ]
                    },
                    {
                        "description": "Marketplace CMS and Service Portal",
                        "tech_used": [
                            "ServiceNow",
                            "HTML",
                            "CSS",
                            "Javascript",
                            "JEXL",
                            "Angular"
                        ],
                        "highlights": [
                            "Implemented Service Catalog on ServiceNow for end users to utilize ServiceNow ITSM modules using CMS",
                            "Migrated Service Catalog hosted in CMS to Service Portal using Angular JS and custom widgets, developed for Service Portal"
                        ]
                    },
                    {
                        "description": "Other activities",
                        "tech_used": [
                            "ServiceNow",
                            "HTML",
                            "CSS",
                            "Javascript",
                            "JEXL",
                            "Angular"
                        ],
                        "highlights": [
                            "Maintained and enhanced existing and new integrations with ServiceNow",
                            "Enhanced ITSM and Change modules in ServiceNow to accomodate customer needs and requirements",
                            "Triage and troubleshoot issues in existing implementations and customizations in ServiceNow"
                        ]
                    }
                ]
            },
            {
                "id": "os_part",
                "title": "ObjectSol Technologies Pvt Ltd.",
                "time": "July 2016 - August 2016",
                "role": "Intern",
                "description": "",
                "responsibilities": [],
                "projects": [
                    {
                        "description": "Sentiment Analysis of Tweets",
                        "tech_used": [
                            "Java",
                            "Java Swing",
                            "Cassandra",
                            "REST APIs",
                            "NLP"
                        ],
                        "highlights": [
                            "Retrieved large counts of tweets from Twitter and stored in a single node Cassandra database",
                            "Classified Tweets in positive or negative sentiments with OpenNLP Java APIs",
                            "Leveraged StanfordNLP to find keywords in tweets to improve insights"
                        ]
                    }
                ]
            },
            {
                "id": "gl_part",
                "title": "Glamoz.com",
                "time": "August 2015 - December 2015",
                "role": "Intern",
                "description": "",
                "responsibilities": [],
                "projects": [
                    {
                        "description": "Developed e-commerce and social network websites",
                        "tech_used": [
                            "PHP",
                            "HTML",
                            "CSS",
                            "PHP"
                        ],
                        "highlights": [
                            "Created search algorithms for faster and contextual searches of various user profiles while interacting with backend databases",
                            "Utilized various jQuery plugins to enable users to edit pictures, upload videos etc",
                            "Incorporated Facebook and Google login options"
                        ]
                    }
                ]
            }
        ],
        "projects": [
            {
                "type": "Systems Projects",
                "list": [
                    "Improved performance of simulation algorithm by leveraging parallel device and multithreaded capabilities of CUDA, OpenACC, OpenMP and MPI. Optimized algorithm my carefully managing memory operations",
                    "Studied performance benefits of the same algorithm by leveraging parallel processing using CUDA, OpenACC, OpenMP and MPI",
                    "Used OpenMP to implement parallel sorting algorithms for evaluating performance benefits vs overheads"
                ]
            },
            {
                "type": "Data Science Projects",
                "list": [
                    "Studied performance of various transformer networks,CNNsand word embeddingsin terms of Bleu Score and Cosine similarityon flickr9k dataset. Used python and tensorflow 2.1",
                    "Performed a study on Multimodal Classification performance (using Python TensorFlow) vs Single mode classification on Yelp dataset to prove whether multimodal performance is better than standard classification",
                    "Accomplished a Feature Selection algorithm leveraging mutual information and Laplacian scores to select relevant features (R, Matlab)",
                    "Sentiment Analysis of Tweets (Java, Cassandra, Natural Language Processing). Retrieved large counts of tweets from Twitter and stored in a single node Cassandra database. Classified Tweets in positive or negative sentiments with OpenNLP Java APIs. Leveraged StanfordNLP to find keywords in tweets to improve insights."
                ]
            },
            {
                "type": "Web Developement Projects",
                "list": [
                    "Created interactive and responsive websites for out annual festivals, enabling increases attention from other Undergraduate colleges",
                    "Designed and Developed registration portal for festival participants to enroll for events, restulting in streamlining and reduced delay in the process"
                ]
            }
        ],
        "skills": [
            {
                "type": "Proficient",
                "list": [
                    {
                        "skill": "Adobe Experience Manager",
                        "icon": "devicon-javascript-plain"
                    },
                    {
                        "skill": "OpenShift",
                        "icon": "devicon-redhat-plain"
                    },
                    {
                        "skill": "Python",
                        "icon": "devicon-python-plain"
                    },
                    {
                        "skill": "Java",
                        "icon": "devicon-java-plain"
                    },
                    {
                        "skill": "Java Spring Boot",
                        "icon": "devicon-spring-plain"
                    },
                    {
                        "skill": "Angular",
                        "icon": "devicon-angularjs-plain"
                    },
                    {
                        "skill": "React",
                        "icon": "devicon-react-original"
                    },
                    {
                        "skill": "PostgreSQL",
                        "icon": "devicon-postgresql-plain"
                    },
                    {
                        "skill": "MySQL",
                        "icon": "devicon-mysql-plain"
                    },
                    {
                        "skill": "AWS",
                        "icon": "devicon-amazonwebservices-original"
                    },
                    {
                        "skill": "Git",
                        "icon": "devicon-git-plain"
                    },
                    {
                        "skill": "Makefiles",
                        "icon": "devicon-bash-plain"
                    },
                    {
                        "skill": "Gitlab Pipelines",
                        "icon": "devicon-gitlab-plain"
                    },
                    {
                        "skill": "ServiceNow",
                        "icon": "devicon-nodejs-plain"
                    },
                    {
                        "skill": "OpenEdx",
                        "icon": "devicon-django-plain"
                    },
                    {
                        "skill": "Docker",
                        "icon": "devicon-docker-plain"
                    },
                    {
                        "skill": "Kubernetes",
                        "icon": "devicon-kubernetes-plain"
                    },
                    {
                        "skill": "OpenStack",
                        "icon": "devicon-linux-plain"
                    },
                    {
                        "skill": "HTML",
                        "icon": "devicon-html5-plain"
                    },
                    {
                        "skill": "CSS",
                        "icon": "devicon-css3-plain"
                    },
                    {
                        "skill": "JavaScript",
                        "icon": "devicon-javascript-plain"
                    },
                    {
                        "skill": "jQuery",
                        "icon": "devicon-jquery-plain"
                    }
                ]
            },
            {
                "type": "Intermediate",
                "list": [
                    {
                        "skill": "Next.js",
                        "icon": "devicon-nextjs-plain"
                    },
                    {
                        "skill": "Alfresco Document Management",
                        "icon": "devicon-java-plain"
                    },
                    {
                        "skill": "OpenMP",
                        "icon": "devicon-c-plain"
                    },
                    {
                        "skill": "MPI",
                        "icon": "devicon-cplusplus-plain"
                    },
                    {
                        "skill": "CUDA",
                        "icon": "devicon-nvidia-plain"
                    },
                    {
                        "skill": "OpenMP",
                        "icon": "devicon-c-plain"
                    },
                    {
                        "skill": "MPI",
                        "icon": "devicon-cplusplus-plain"
                    },
                    {
                        "skill": "R",
                        "icon": "devicon-r-plain"
                    },
                    {
                        "skill": "PHP",
                        "icon": "devicon-php-plain"
                    },
                    {
                        "skill": "C#",
                        "icon": "devicon-csharp-plain"
                    },
                    {
                        "skill": "ASP.NET",
                        "icon": "devicon-dot-net-plain"
                    }
                ]
            }
        ],
        "extra": []
    }
}